camel-simple-bus/src/test/resources/xml/transform1-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bus="http://bus.cinimex.ru">
   <soapenv:Header/>
   <soapenv:Body>
      <bus:inputTransform1>
         <userList>       
           <user>
            <name>ARS</name>
            <age>29</age>
            <interestList>
              <diving><messagesCount>5</messagesCount></diving>
              <music><messagesCount>5</messagesCount></music>
              <sport><messagesCount>2</messagesCount></sport>
              <travel><messagesCount>1</messagesCount></travel>
            </interestList>
            <messagesCount>5</messagesCount>
           </user>   
           <user>
            <name>ARS2</name>
            <age>25</age>
            <interestList>
              <sport><messagesCount>2</messagesCount></sport>
              <music><messagesCount>5</messagesCount></music>
              <travel><messagesCount>2</messagesCount></travel>
            </interestList>
            <messagesCount>3</messagesCount>
           </user>      
         </userList>
      </bus:inputTransform1>
   </soapenv:Body>
</soapenv:Envelope>