camel-simple-bus/src/test/resources/xml/transform2-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:bus="http://bus.cinimex.ru">
	<soapenv:Header />
	<soapenv:Body>
		<bus:inputTransform2>
			<userList>
				<user>
					<name>ARS</name>
					<age>29</age>
					<interestList>
						<interest>
							<name>diving</name>
							<messagesCount>5</messagesCount>
						</interest>
						<interest>
							<name>music</name>
							<messagesCount>5</messagesCount>
						</interest>
						<interest>
							<name>sport</name>
							<messagesCount>7</messagesCount>
						</interest>
						<interest>
							<name>travel</name>
							<messagesCount>1</messagesCount>
						</interest>
					</interestList>
					<messagesCount>6</messagesCount>
				</user>
				<user>
					<name>ARS2</name>
					<age>25</age>
					<interestList>
						<interest>
							<name>sport</name>
							<messagesCount>2</messagesCount>
						</interest>
						<interest>
							<name>music</name>
							<messagesCount>5</messagesCount>
						</interest>
						<interest>
							<name>travel</name>
							<messagesCount>2</messagesCount>
						</interest>
					</interestList>
					<messagesCount>3</messagesCount>
				</user>
			</userList>
		</bus:inputTransform2>
	</soapenv:Body>
</soapenv:Envelope>