src/test/resources/xml/transform1-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bus="http://bus.cinimex.ru">
   <soapenv:Header/>
   <soapenv:Body>
      <bus:inputTransform1>
         <userList>
           <user>
            <name>ARS</name>
            <age>29</age>
              <interestList>
                <interest>
                  <name>Music</name>
                  <messagesCount>5</messagesCount>
                </interest>
              </interestList>
              <messagesCount>5</messagesCount>
           </user>
         </userList>
      </bus:inputTransform1>
   </soapenv:Body>
</soapenv:Envelope>